---
kind: type
id: T:Autodesk.Revit.DB.WallSweepType
source: html/f66354e5-a9c6-de97-695c-4a2fba036232.htm
---
# Autodesk.Revit.DB.WallSweepType

Represents the possible types for methods affecting wall sweeps or reveals.

## Syntax (C#)
```csharp
public enum WallSweepType
```